MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Source/IAR/startup_hc32f558.s
                PUBWEAK UsageFault_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
UsageFault_Handler
                B       UsageFault_Handler

                PUBWEAK SVC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SVC_Handler
                B       SVC_Handler

                PUBWEAK DebugMon_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DebugMon_Handler
                B       DebugMon_Handler

                PUBWEAK PendSV_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PendSV_Handler
                B       PendSV_Handler

                PUBWEAK SysTick_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SysTick_Handler
                B       SysTick_Handler

                PUBWEAK IRQ000_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ000_Handler
                B       IRQ000_Handler

                PUBWEAK IRQ001_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ001_Handler
                B       IRQ001_Handler

                PUBWEAK IRQ002_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ002_Handler
                B       IRQ002_Handler

                PUBWEAK IRQ003_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ003_Handler
                B       IRQ003_Handler

                PUBWEAK IRQ004_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ004_Handler
                B       IRQ004_Handler

                PUBWEAK IRQ005_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ005_Handler
                B       IRQ005_Handler

                PUBWEAK IRQ006_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ006_Handler
                B       IRQ006_Handler

                PUBWEAK IRQ007_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ007_Handler
                B       IRQ007_Handler

                PUBWEAK IRQ008_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ008_Handler
                B       IRQ008_Handler

                PUBWEAK IRQ009_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ009_Handler
                B       IRQ009_Handler

                PUBWEAK IRQ010_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ010_Handler
                B       IRQ010_Handler

                PUBWEAK IRQ011_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ011_Handler
                B       IRQ011_Handler

                PUBWEAK IRQ012_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ012_Handler
                B       IRQ012_Handler

                PUBWEAK IRQ013_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ013_Handler
                B       IRQ013_Handler

                PUBWEAK IRQ014_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ014_Handler
                B       IRQ014_Handler

                PUBWEAK IRQ015_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ015_Handler
                B       IRQ015_Handler

                PUBWEAK EXTINT_PORT_EIRQ0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ0_Handler
                B       EXTINT_PORT_EIRQ0_Handler

                PUBWEAK EXTINT_PORT_EIRQ1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ1_Handler
                B       EXTINT_PORT_EIRQ1_Handler

                PUBWEAK EXTINT_PORT_EIRQ2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ2_Handler
                B       EXTINT_PORT_EIRQ2_Handler

                PUBWEAK EXTINT_PORT_EIRQ3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ3_Handler
                B       EXTINT_PORT_EIRQ3_Handler

                PUBWEAK EXTINT_PORT_EIRQ4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ4_Handler
                B       EXTINT_PORT_EIRQ4_Handler

                PUBWEAK EXTINT_PORT_EIRQ5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ5_Handler
                B       EXTINT_PORT_EIRQ5_Handler

                PUBWEAK EXTINT_PORT_EIRQ6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ6_Handler
                B       EXTINT_PORT_EIRQ6_Handler

                PUBWEAK EXTINT_PORT_EIRQ7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ7_Handler
                B       EXTINT_PORT_EIRQ7_Handler

                PUBWEAK EXTINT_PORT_EIRQ8_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ8_Handler
                B       EXTINT_PORT_EIRQ8_Handler

                PUBWEAK EXTINT_PORT_EIRQ9_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ9_Handler
                B       EXTINT_PORT_EIRQ9_Handler

                PUBWEAK EXTINT_PORT_EIRQ10_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ10_Handler
                B       EXTINT_PORT_EIRQ10_Handler

                PUBWEAK EXTINT_PORT_EIRQ11_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ11_Handler
                B       EXTINT_PORT_EIRQ11_Handler

                PUBWEAK EXTINT_PORT_EIRQ12_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ12_Handler
                B       EXTINT_PORT_EIRQ12_Handler

                PUBWEAK EXTINT_PORT_EIRQ13_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ13_Handler
                B       EXTINT_PORT_EIRQ13_Handler

                PUBWEAK EXTINT_PORT_EIRQ14_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ14_Handler
                B       EXTINT_PORT_EIRQ14_Handler

                PUBWEAK EXTINT_PORT_EIRQ15_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT_PORT_EIRQ15_Handler
                B       EXTINT_PORT_EIRQ15_Handler

                PUBWEAK DMA1_Error_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Error_Handler
                B       DMA1_Error_Handler

                PUBWEAK DMA1_TC0_BTC0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC0_BTC0_Handler
                B       DMA1_TC0_BTC0_Handler

                PUBWEAK DMA1_TC1_BTC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC1_BTC1_Handler
                B       DMA1_TC1_BTC1_Handler

