MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Source/IAR/startup_hc32f558.s
                PUBWEAK TMR6_5_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_GCmp_Handler
                B       TMR6_5_GCmp_Handler

                PUBWEAK TMR6_5_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_Ovf_Udf_Handler
                B       TMR6_5_Ovf_Udf_Handler

                PUBWEAK TMR6_5_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_Dte_Handler
                B       TMR6_5_Dte_Handler

                PUBWEAK TMR6_5_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_SCmp_Handler
                B       TMR6_5_SCmp_Handler

                PUBWEAK TMR6_6_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_GCmp_Handler
                B       TMR6_6_GCmp_Handler

                PUBWEAK TMR6_6_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_Ovf_Udf_Handler
                B       TMR6_6_Ovf_Udf_Handler

                PUBWEAK TMR6_6_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_Dte_Handler
                B       TMR6_6_Dte_Handler

                PUBWEAK TMR6_6_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_SCmp_Handler
                B       TMR6_6_SCmp_Handler

                PUBWEAK TRLPWM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TRLPWM_Handler
                B       TRLPWM_Handler

                PUBWEAK EMB_GR0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR0_Handler
                B       EMB_GR0_Handler

                PUBWEAK EMB_GR1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR1_Handler
                B       EMB_GR1_Handler

                PUBWEAK EMB_GR2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR2_Handler
                B       EMB_GR2_Handler

                PUBWEAK EMB_GR3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR3_Handler
                B       EMB_GR3_Handler

                PUBWEAK EMB_GR4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR4_Handler
                B       EMB_GR4_Handler

                PUBWEAK EMB_GR5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR5_Handler
                B       EMB_GR5_Handler

                PUBWEAK HRPWM_1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_1_Handler
                B       HRPWM_1_Handler

                PUBWEAK HRPWM_2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_2_Handler
                B       HRPWM_2_Handler

                PUBWEAK HRPWM_3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_3_Handler
                B       HRPWM_3_Handler

                PUBWEAK HRPWM_4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_4_Handler
                B       HRPWM_4_Handler

                PUBWEAK HRPWM_5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_5_Handler
                B       HRPWM_5_Handler

                PUBWEAK HRPWM_6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_6_Handler
                B       HRPWM_6_Handler

                PUBWEAK HRPWM_7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_7_Handler
                B       HRPWM_7_Handler

                PUBWEAK HRPWM_8_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_8_Handler
                B       HRPWM_8_Handler

                PUBWEAK HRPWM_EMB_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_EMB_Handler
                B       HRPWM_EMB_Handler

                PUBWEAK SDFM_FILTER0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SDFM_FILTER0_Handler
                B       SDFM_FILTER0_Handler

                PUBWEAK SDFM_FILTER1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SDFM_FILTER1_Handler
                B       SDFM_FILTER1_Handler

                PUBWEAK SDFM_FILTER2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SDFM_FILTER2_Handler
                B       SDFM_FILTER2_Handler

                PUBWEAK SDFM_FILTER3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SDFM_FILTER3_Handler
                B       SDFM_FILTER3_Handler

                PUBWEAK CMP1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP1_Handler
                B       CMP1_Handler

                PUBWEAK CMP2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP2_Handler
                B       CMP2_Handler

                PUBWEAK CMP3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP3_Handler
                B       CMP3_Handler

                PUBWEAK CMP4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP4_Handler
                B       CMP4_Handler

                PUBWEAK CMP5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP5_Handler
                B       CMP5_Handler

                PUBWEAK CMP6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP6_Handler
                B       CMP6_Handler

                PUBWEAK CMP7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP7_Handler
                B       CMP7_Handler

                PUBWEAK CMP8_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CMP8_Handler
                B       CMP8_Handler

                PUBWEAK SPI1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI1_Handler
                B       SPI1_Handler

                PUBWEAK SPI2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI2_Handler
                B       SPI2_Handler

                PUBWEAK SPI3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI3_Handler
                B       SPI3_Handler

                PUBWEAK EVENT_PORT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT1_Handler
                B       EVENT_PORT1_Handler

                PUBWEAK EVENT_PORT2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT2_Handler
                B       EVENT_PORT2_Handler

