MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Source/IAR/startup_hc32f558.s
                PUBWEAK EVENT_PORT3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT3_Handler
                B       EVENT_PORT3_Handler

                PUBWEAK EVENT_PORT4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EVENT_PORT4_Handler
                B       EVENT_PORT4_Handler

                PUBWEAK MCANRAM_ECCER_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCANRAM_ECCER_Handler
                B       MCANRAM_ECCER_Handler

                PUBWEAK MCAN1_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN1_INT0_Handler
                B       MCAN1_INT0_Handler

                PUBWEAK MCAN1_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN1_INT1_Handler
                B       MCAN1_INT1_Handler

                PUBWEAK MCAN2_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN2_INT0_Handler
                B       MCAN2_INT0_Handler

                PUBWEAK MCAN2_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN2_INT1_Handler
                B       MCAN2_INT1_Handler

                PUBWEAK MCAN3_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN3_INT0_Handler
                B       MCAN3_INT0_Handler

                PUBWEAK MCAN3_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN3_INT1_Handler
                B       MCAN3_INT1_Handler

                PUBWEAK USART1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_Handler
                B       USART1_Handler

                PUBWEAK USART1_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_TxComplete_Handler
                B       USART1_TxComplete_Handler

                PUBWEAK USART2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART2_Handler
                B       USART2_Handler

                PUBWEAK USART2_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART2_TxComplete_Handler
                B       USART2_TxComplete_Handler

                PUBWEAK USART3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART3_Handler
                B       USART3_Handler

                PUBWEAK USART3_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART3_TxComplete_Handler
                B       USART3_TxComplete_Handler

                PUBWEAK USART4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART4_Handler
                B       USART4_Handler

                PUBWEAK USART4_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART4_TxComplete_Handler
                B       USART4_TxComplete_Handler

                PUBWEAK HASH_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HASH_Handler
                B       HASH_Handler

                PUBWEAK SKE_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SKE_Handler
                B       SKE_Handler

                PUBWEAK SOGI_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SOGI_Handler
                B       SOGI_Handler

                PUBWEAK I2C1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_Handler
                B       I2C1_Handler

                PUBWEAK I2C2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_Handler
                B       I2C2_Handler

                PUBWEAK I2C3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_Handler
                B       I2C3_Handler

                PUBWEAK SPI_SS0_WUPI_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SPI_SS0_WUPI_Handler
                B       SPI_SS0_WUPI_Handler

                PUBWEAK USART1_WUPI_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_WUPI_Handler
                B       USART1_WUPI_Handler

                PUBWEAK LVD1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
LVD1_Handler
                B       LVD1_Handler

                PUBWEAK LVD2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
LVD2_Handler
                B       LVD2_Handler

                PUBWEAK FCM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FCM_Handler
                B       FCM_Handler

                PUBWEAK WDT_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
WDT_Handler
                B       WDT_Handler

                PUBWEAK CTC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CTC_Handler
                B       CTC_Handler

                PUBWEAK ERMU_LPI_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ERMU_LPI_Handler
                B       ERMU_LPI_Handler

                PUBWEAK ADC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC1_Handler
                B       ADC1_Handler

                PUBWEAK ADC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_Handler
                B       ADC2_Handler

                PUBWEAK ADC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC3_Handler
                B       ADC3_Handler

                PUBWEAK ADC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC4_Handler
                B       ADC4_Handler

                PUBWEAK TRNG_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TRNG_Handler
                B       TRNG_Handler

                END
